ir_version: 8
producer_name: "pytorch"
producer_version: "2.2.0"
graph {
  node {
    input: "l_x_"
    input: "conv_stem.weight"
    output: "conv_stem_1"
    name: "torch_nn_modules_conv_Conv2d_conv_stem_1_0"
    op_type: "torch_nn_modules_conv_Conv2d_conv_stem_1"
    domain: "pkg.torch.2.2.0a0+git63d65dd"
  }
  node {
    input: "conv_stem_1"
    input: "bn1.running_mean"
    input: "bn1.running_var"
    input: "bn1.weight"
    input: "bn1.bias"
    output: "bn1_1"
    name: "timm_layers_norm_act_BatchNormAct2d_bn1_1_1"
    op_type: "timm_layers_norm_act_BatchNormAct2d_bn1_1"
    domain: "pkg.timm.0.9.7"
  }
  node {
    input: "bn1_1"
    input: "blocks.0.0.conv_dw.weight"
    input: "blocks.0.0.bn1.running_mean"
    input: "blocks.0.0.bn1.running_var"
    input: "blocks.0.0.bn1.weight"
    input: "blocks.0.0.bn1.bias"
    input: "blocks.0.0.conv_pw.weight"
    input: "blocks.0.0.bn2.running_mean"
    input: "blocks.0.0.bn2.running_var"
    input: "blocks.0.0.bn2.weight"
    input: "blocks.0.0.bn2.bias"
    input: "blocks.1.0.conv_pw.weight"
    input: "blocks.1.0.bn1.running_mean"
    input: "blocks.1.0.bn1.running_var"
    input: "blocks.1.0.bn1.weight"
    input: "blocks.1.0.bn1.bias"
    input: "blocks.1.0.conv_dw.weight"
    input: "blocks.1.0.bn2.running_mean"
    input: "blocks.1.0.bn2.running_var"
    input: "blocks.1.0.bn2.weight"
    input: "blocks.1.0.bn2.bias"
    input: "blocks.1.0.conv_pwl.weight"
    input: "blocks.1.0.bn3.running_mean"
    input: "blocks.1.0.bn3.running_var"
    input: "blocks.1.0.bn3.weight"
    input: "blocks.1.0.bn3.bias"
    input: "blocks.1.1.conv_pw.weight"
    input: "blocks.1.1.bn1.running_mean"
    input: "blocks.1.1.bn1.running_var"
    input: "blocks.1.1.bn1.weight"
    input: "blocks.1.1.bn1.bias"
    input: "blocks.1.1.conv_dw.weight"
    input: "blocks.1.1.bn2.running_mean"
    input: "blocks.1.1.bn2.running_var"
    input: "blocks.1.1.bn2.weight"
    input: "blocks.1.1.bn2.bias"
    input: "blocks.1.1.conv_pwl.weight"
    input: "blocks.1.1.bn3.running_mean"
    input: "blocks.1.1.bn3.running_var"
    input: "blocks.1.1.bn3.weight"
    input: "blocks.1.1.bn3.bias"
    input: "blocks.2.0.conv_pw.weight"
    input: "blocks.2.0.bn1.running_mean"
    input: "blocks.2.0.bn1.running_var"
    input: "blocks.2.0.bn1.weight"
    input: "blocks.2.0.bn1.bias"
    input: "blocks.2.0.conv_dw.weight"
    input: "blocks.2.0.bn2.running_mean"
    input: "blocks.2.0.bn2.running_var"
    input: "blocks.2.0.bn2.weight"
    input: "blocks.2.0.bn2.bias"
    input: "blocks.2.0.conv_pwl.weight"
    input: "blocks.2.0.bn3.running_mean"
    input: "blocks.2.0.bn3.running_var"
    input: "blocks.2.0.bn3.weight"
    input: "blocks.2.0.bn3.bias"
    input: "blocks.2.1.conv_pw.weight"
    input: "blocks.2.1.bn1.running_mean"
    input: "blocks.2.1.bn1.running_var"
    input: "blocks.2.1.bn1.weight"
    input: "blocks.2.1.bn1.bias"
    input: "blocks.2.1.conv_dw.weight"
    input: "blocks.2.1.bn2.running_mean"
    input: "blocks.2.1.bn2.running_var"
    input: "blocks.2.1.bn2.weight"
    input: "blocks.2.1.bn2.bias"
    input: "blocks.2.1.conv_pwl.weight"
    input: "blocks.2.1.bn3.running_mean"
    input: "blocks.2.1.bn3.running_var"
    input: "blocks.2.1.bn3.weight"
    input: "blocks.2.1.bn3.bias"
    input: "blocks.2.2.conv_pw.weight"
    input: "blocks.2.2.bn1.running_mean"
    input: "blocks.2.2.bn1.running_var"
    input: "blocks.2.2.bn1.weight"
    input: "blocks.2.2.bn1.bias"
    input: "blocks.2.2.conv_dw.weight"
    input: "blocks.2.2.bn2.running_mean"
    input: "blocks.2.2.bn2.running_var"
    input: "blocks.2.2.bn2.weight"
    input: "blocks.2.2.bn2.bias"
    input: "blocks.2.2.conv_pwl.weight"
    input: "blocks.2.2.bn3.running_mean"
    input: "blocks.2.2.bn3.running_var"
    input: "blocks.2.2.bn3.weight"
    input: "blocks.2.2.bn3.bias"
    input: "blocks.3.0.conv_pw.weight"
    input: "blocks.3.0.bn1.running_mean"
    input: "blocks.3.0.bn1.running_var"
    input: "blocks.3.0.bn1.weight"
    input: "blocks.3.0.bn1.bias"
    input: "blocks.3.0.conv_dw.weight"
    input: "blocks.3.0.bn2.running_mean"
    input: "blocks.3.0.bn2.running_var"
    input: "blocks.3.0.bn2.weight"
    input: "blocks.3.0.bn2.bias"
    input: "blocks.3.0.conv_pwl.weight"
    input: "blocks.3.0.bn3.running_mean"
    input: "blocks.3.0.bn3.running_var"
    input: "blocks.3.0.bn3.weight"
    input: "blocks.3.0.bn3.bias"
    input: "blocks.3.1.conv_pw.weight"
    input: "blocks.3.1.bn1.running_mean"
    input: "blocks.3.1.bn1.running_var"
    input: "blocks.3.1.bn1.weight"
    input: "blocks.3.1.bn1.bias"
    input: "blocks.3.1.conv_dw.weight"
    input: "blocks.3.1.bn2.running_mean"
    input: "blocks.3.1.bn2.running_var"
    input: "blocks.3.1.bn2.weight"
    input: "blocks.3.1.bn2.bias"
    input: "blocks.3.1.conv_pwl.weight"
    input: "blocks.3.1.bn3.running_mean"
    input: "blocks.3.1.bn3.running_var"
    input: "blocks.3.1.bn3.weight"
    input: "blocks.3.1.bn3.bias"
    input: "blocks.3.2.conv_pw.weight"
    input: "blocks.3.2.bn1.running_mean"
    input: "blocks.3.2.bn1.running_var"
    input: "blocks.3.2.bn1.weight"
    input: "blocks.3.2.bn1.bias"
    input: "blocks.3.2.conv_dw.weight"
    input: "blocks.3.2.bn2.running_mean"
    input: "blocks.3.2.bn2.running_var"
    input: "blocks.3.2.bn2.weight"
    input: "blocks.3.2.bn2.bias"
    input: "blocks.3.2.conv_pwl.weight"
    input: "blocks.3.2.bn3.running_mean"
    input: "blocks.3.2.bn3.running_var"
    input: "blocks.3.2.bn3.weight"
    input: "blocks.3.2.bn3.bias"
    input: "blocks.3.3.conv_pw.weight"
    input: "blocks.3.3.bn1.running_mean"
    input: "blocks.3.3.bn1.running_var"
    input: "blocks.3.3.bn1.weight"
    input: "blocks.3.3.bn1.bias"
    input: "blocks.3.3.conv_dw.weight"
    input: "blocks.3.3.bn2.running_mean"
    input: "blocks.3.3.bn2.running_var"
    input: "blocks.3.3.bn2.weight"
    input: "blocks.3.3.bn2.bias"
    input: "blocks.3.3.conv_pwl.weight"
    input: "blocks.3.3.bn3.running_mean"
    input: "blocks.3.3.bn3.running_var"
    input: "blocks.3.3.bn3.weight"
    input: "blocks.3.3.bn3.bias"
    input: "blocks.4.0.conv_pw.weight"
    input: "blocks.4.0.bn1.running_mean"
    input: "blocks.4.0.bn1.running_var"
    input: "blocks.4.0.bn1.weight"
    input: "blocks.4.0.bn1.bias"
    input: "blocks.4.0.conv_dw.weight"
    input: "blocks.4.0.bn2.running_mean"
    input: "blocks.4.0.bn2.running_var"
    input: "blocks.4.0.bn2.weight"
    input: "blocks.4.0.bn2.bias"
    input: "blocks.4.0.conv_pwl.weight"
    input: "blocks.4.0.bn3.running_mean"
    input: "blocks.4.0.bn3.running_var"
    input: "blocks.4.0.bn3.weight"
    input: "blocks.4.0.bn3.bias"
    input: "blocks.4.1.conv_pw.weight"
    input: "blocks.4.1.bn1.running_mean"
    input: "blocks.4.1.bn1.running_var"
    input: "blocks.4.1.bn1.weight"
    input: "blocks.4.1.bn1.bias"
    input: "blocks.4.1.conv_dw.weight"
    input: "blocks.4.1.bn2.running_mean"
    input: "blocks.4.1.bn2.running_var"
    input: "blocks.4.1.bn2.weight"
    input: "blocks.4.1.bn2.bias"
    input: "blocks.4.1.conv_pwl.weight"
    input: "blocks.4.1.bn3.running_mean"
    input: "blocks.4.1.bn3.running_var"
    input: "blocks.4.1.bn3.weight"
    input: "blocks.4.1.bn3.bias"
    input: "blocks.4.2.conv_pw.weight"
    input: "blocks.4.2.bn1.running_mean"
    input: "blocks.4.2.bn1.running_var"
    input: "blocks.4.2.bn1.weight"
    input: "blocks.4.2.bn1.bias"
    input: "blocks.4.2.conv_dw.weight"
    input: "blocks.4.2.bn2.running_mean"
    input: "blocks.4.2.bn2.running_var"
    input: "blocks.4.2.bn2.weight"
    input: "blocks.4.2.bn2.bias"
    input: "blocks.4.2.conv_pwl.weight"
    input: "blocks.4.2.bn3.running_mean"
    input: "blocks.4.2.bn3.running_var"
    input: "blocks.4.2.bn3.weight"
    input: "blocks.4.2.bn3.bias"
    input: "blocks.5.0.conv_pw.weight"
    input: "blocks.5.0.bn1.running_mean"
    input: "blocks.5.0.bn1.running_var"
    input: "blocks.5.0.bn1.weight"
    input: "blocks.5.0.bn1.bias"
    input: "blocks.5.0.conv_dw.weight"
    input: "blocks.5.0.bn2.running_mean"
    input: "blocks.5.0.bn2.running_var"
    input: "blocks.5.0.bn2.weight"
    input: "blocks.5.0.bn2.bias"
    input: "blocks.5.0.conv_pwl.weight"
    input: "blocks.5.0.bn3.running_mean"
    input: "blocks.5.0.bn3.running_var"
    input: "blocks.5.0.bn3.weight"
    input: "blocks.5.0.bn3.bias"
    input: "blocks.5.1.conv_pw.weight"
    input: "blocks.5.1.bn1.running_mean"
    input: "blocks.5.1.bn1.running_var"
    input: "blocks.5.1.bn1.weight"
    input: "blocks.5.1.bn1.bias"
    input: "blocks.5.1.conv_dw.weight"
    input: "blocks.5.1.bn2.running_mean"
    input: "blocks.5.1.bn2.running_var"
    input: "blocks.5.1.bn2.weight"
    input: "blocks.5.1.bn2.bias"
    input: "blocks.5.1.conv_pwl.weight"
    input: "blocks.5.1.bn3.running_mean"
    input: "blocks.5.1.bn3.running_var"
    input: "blocks.5.1.bn3.weight"
    input: "blocks.5.1.bn3.bias"
    input: "blocks.5.2.conv_pw.weight"
    input: "blocks.5.2.bn1.running_mean"
    input: "blocks.5.2.bn1.running_var"
    input: "blocks.5.2.bn1.weight"
    input: "blocks.5.2.bn1.bias"
    input: "blocks.5.2.conv_dw.weight"
    input: "blocks.5.2.bn2.running_mean"
    input: "blocks.5.2.bn2.running_var"
    input: "blocks.5.2.bn2.weight"
    input: "blocks.5.2.bn2.bias"
    input: "blocks.5.2.conv_pwl.weight"
    input: "blocks.5.2.bn3.running_mean"
    input: "blocks.5.2.bn3.running_var"
    input: "blocks.5.2.bn3.weight"
    input: "blocks.5.2.bn3.bias"
    input: "blocks.6.0.conv_pw.weight"
    input: "blocks.6.0.bn1.running_mean"
    input: "blocks.6.0.bn1.running_var"
    input: "blocks.6.0.bn1.weight"
    input: "blocks.6.0.bn1.bias"
    input: "blocks.6.0.conv_dw.weight"
    input: "blocks.6.0.bn2.running_mean"
    input: "blocks.6.0.bn2.running_var"
    input: "blocks.6.0.bn2.weight"
    input: "blocks.6.0.bn2.bias"
    input: "blocks.6.0.conv_pwl.weight"
    input: "blocks.6.0.bn3.running_mean"
    input: "blocks.6.0.bn3.running_var"
    input: "blocks.6.0.bn3.weight"
    input: "blocks.6.0.bn3.bias"
    output: "blocks_1"
    name: "torch_nn_modules_container_Sequential_blocks_1_2"
    op_type: "torch_nn_modules_container_Sequential_blocks_1"
    domain: "pkg.torch.2.2.0a0+git63d65dd"
  }
  node {
    input: "blocks_1"
    input: "conv_head.weight"
    output: "conv_head_1"
    name: "torch_nn_modules_conv_Conv2d_conv_head_1_3"
    op_type: "torch_nn_modules_conv_Conv2d_conv_head_1"
    domain: "pkg.torch.2.2.0a0+git63d65dd"
  }
  node {
    input: "conv_head_1"
    input: "bn2.running_mean"
    input: "bn2.running_var"
    input: "bn2.weight"
    input: "bn2.bias"
    output: "bn2_1"
    name: "timm_layers_norm_act_BatchNormAct2d_bn2_1_4"
    op_type: "timm_layers_norm_act_BatchNormAct2d_bn2_1"
    domain: "pkg.timm.0.9.7"
  }
  node {
    input: "bn2_1"
    output: "global_pool_1"
    name: "timm_layers_adaptive_avgmax_pool_SelectAdaptivePool2d_global_pool_1_5"
    op_type: "timm_layers_adaptive_avgmax_pool_SelectAdaptivePool2d_global_pool_1"
    domain: "pkg.timm.0.9.7"
  }
  node {
    input: "global_pool_1"
    input: "classifier.weight"
    input: "classifier.bias"
    output: "classifier_1"
    name: "torch_nn_modules_linear_Linear_classifier_1_6"
    op_type: "torch_nn_modules_linear_Linear_classifier_1"
    domain: "pkg.torch.2.2.0a0+git63d65dd"
  }
  name: "main_graph"
  initializer {
    dims: 32
    dims: 3
    dims: 3
    dims: 3
    data_type: 1
    name: "conv_stem.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 32
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.0.0.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.0.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.0.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.0.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.0.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 16
    dims: 32
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.0.0.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 16
    data_type: 1
    name: "blocks.0.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 16
    data_type: 1
    name: "blocks.0.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 16
    data_type: 1
    name: "blocks.0.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 16
    data_type: 1
    name: "blocks.0.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 96
    dims: 16
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.1.0.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 96
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.1.0.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.1.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 24
    dims: 96
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.1.0.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.0.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.0.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.0.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.0.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 144
    dims: 24
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.1.1.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 144
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.1.1.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.1.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 24
    dims: 144
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.1.1.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.1.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.1.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.1.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 24
    data_type: 1
    name: "blocks.1.1.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 144
    dims: 24
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.2.0.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 144
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.2.0.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 144
    data_type: 1
    name: "blocks.2.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 32
    dims: 144
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.2.0.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.0.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.0.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.0.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.0.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 192
    dims: 32
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.2.1.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 192
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.2.1.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 32
    dims: 192
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.2.1.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.1.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.1.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.1.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.1.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 192
    dims: 32
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.2.2.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 192
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.2.2.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.2.2.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 32
    dims: 192
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.2.2.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.2.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.2.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.2.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 32
    data_type: 1
    name: "blocks.2.2.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 192
    dims: 32
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.0.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 192
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.3.0.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 192
    data_type: 1
    name: "blocks.3.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 192
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.0.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.0.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.0.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.0.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.0.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 64
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.1.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.3.1.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 384
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.1.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.1.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.1.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.1.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.1.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 64
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.2.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.3.2.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.2.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 384
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.2.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.2.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.2.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.2.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.2.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 64
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.3.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.3.3.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.3.3.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 384
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.3.3.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.3.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.3.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.3.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "blocks.3.3.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 64
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.4.0.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 384
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.4.0.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 384
    data_type: 1
    name: "blocks.4.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 96
    dims: 384
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.4.0.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.0.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.0.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.0.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.0.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 576
    dims: 96
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.4.1.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 576
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.4.1.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 96
    dims: 576
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.4.1.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.1.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.1.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.1.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.1.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 576
    dims: 96
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.4.2.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 576
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.4.2.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.4.2.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 96
    dims: 576
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.4.2.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.2.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.2.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.2.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 96
    data_type: 1
    name: "blocks.4.2.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 576
    dims: 96
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.5.0.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 576
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.5.0.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 576
    data_type: 1
    name: "blocks.5.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 160
    dims: 576
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.5.0.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.0.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.0.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.0.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.0.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 960
    dims: 160
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.5.1.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 960
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.5.1.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 160
    dims: 960
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.5.1.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.1.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.1.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.1.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.1.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 960
    dims: 160
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.5.2.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 960
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.5.2.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.5.2.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 160
    dims: 960
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.5.2.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.2.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.2.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.2.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 160
    data_type: 1
    name: "blocks.5.2.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 960
    dims: 160
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.6.0.conv_pw.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 960
    dims: 1
    dims: 3
    dims: 3
    data_type: 1
    name: "blocks.6.0.conv_dw.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 960
    data_type: 1
    name: "blocks.6.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 320
    dims: 960
    dims: 1
    dims: 1
    data_type: 1
    name: "blocks.6.0.conv_pwl.weight"
    raw_data: ""
  }
  initializer {
    dims: 320
    data_type: 1
    name: "blocks.6.0.bn3.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 320
    data_type: 1
    name: "blocks.6.0.bn3.running_var"
    raw_data: ""
  }
  initializer {
    dims: 320
    data_type: 1
    name: "blocks.6.0.bn3.weight"
    raw_data: ""
  }
  initializer {
    dims: 320
    data_type: 1
    name: "blocks.6.0.bn3.bias"
    raw_data: ""
  }
  initializer {
    dims: 1280
    dims: 320
    dims: 1
    dims: 1
    data_type: 1
    name: "conv_head.weight"
    raw_data: ""
  }
  initializer {
    dims: 1280
    data_type: 1
    name: "bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 1280
    data_type: 1
    name: "bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 1280
    data_type: 1
    name: "bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 1280
    data_type: 1
    name: "bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 1000
    dims: 1280
    data_type: 1
    name: "classifier.weight"
    raw_data: ""
  }
  initializer {
    dims: 1000
    data_type: 1
    name: "classifier.bias"
    raw_data: ""
  }
  input {
    name: "l_x_"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  output {
    name: "classifier_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
  value_info {
    name: "conv_stem.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.conv_dw.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.conv_pw.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.0.0.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.conv_pw.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.conv_dw.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 96
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.conv_pwl.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 24
          }
          dim {
            dim_value: 96
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn3.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn3.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn3.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.0.bn3.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 24
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.conv_pw.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
          dim {
            dim_value: 24
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.conv_dw.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
        }
      }
    }
  }
  value_info {
    name: "blocks.1.1.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 144
          }
        }
      }
