ir_version: 8
producer_name: "pytorch"
producer_version: "2.3.0"
graph {
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.norm.weight"
    name: "Identity_326"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.9.post_attention_layernorm.weight"
    name: "Identity_327"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.9.input_layernorm.weight"
    name: "Identity_328"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.8.post_attention_layernorm.weight"
    name: "Identity_329"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.8.input_layernorm.weight"
    name: "Identity_330"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.7.post_attention_layernorm.weight"
    name: "Identity_331"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.7.input_layernorm.weight"
    name: "Identity_332"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.6.post_attention_layernorm.weight"
    name: "Identity_333"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.6.input_layernorm.weight"
    name: "Identity_334"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.5.post_attention_layernorm.weight"
    name: "Identity_335"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.5.input_layernorm.weight"
    name: "Identity_336"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.4.post_attention_layernorm.weight"
    name: "Identity_337"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.4.input_layernorm.weight"
    name: "Identity_338"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.3.post_attention_layernorm.weight"
    name: "Identity_339"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.3.input_layernorm.weight"
    name: "Identity_340"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.2.post_attention_layernorm.weight"
    name: "Identity_341"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.2.input_layernorm.weight"
    name: "Identity_342"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.1.post_attention_layernorm.weight"
    name: "Identity_343"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.1.input_layernorm.weight"
    name: "Identity_344"
    op_type: "Identity"
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    output: "model.layers.0.post_attention_layernorm.weight"
    name: "Identity_345"
    op_type: "Identity"
  }
  node {
    output: "/model/Constant_output_0"
    name: "/model/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 8
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\003\000\000\000\000\000\000\000\004\000\000\000\000\000\000\000\005\000\000\000\000\000\000\000\006\000\000\000\000\000\000\000\007\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "model.embed_tokens.weight"
    input: "input.1"
    output: "/model/embed_tokens/Gather_output_0"
    name: "/model/embed_tokens/Gather"
    op_type: "Gather"
  }
  node {
    output: "/model/Constant_1_output_0"
    name: "/model/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 1
        dims: 8
        dims: 8
        data_type: 1
        raw_data: "\000\000\000\000\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\000\000\000\000\000\000\000\000\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\000\000\000\000\000\000\000\000\000\000\000\000\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\377\377\177\377\377\377\177\377\377\377\177\377\377\377\177\377\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\377\377\177\377\377\377\177\377\377\377\177\377\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\377\377\177\377\377\377\177\377\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\377\377\177\377\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/Constant_2_output_0"
    name: "/model/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/Constant_3_output_0"
    name: "/model/Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/Constant_3_output_0"
    output: "/model/ConstantOfShape_output_0"
    name: "/model/ConstantOfShape"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/Constant_4_output_0"
    name: "/model/Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/ConstantOfShape_output_0"
    input: "/model/Constant_4_output_0"
    output: "/model/Mul_output_0"
    name: "/model/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model/Constant_2_output_0"
    input: "/model/Mul_output_0"
    output: "/model/Equal_output_0"
    name: "/model/Equal"
    op_type: "Equal"
  }
  node {
    input: "/model/Equal_output_0"
    input: "/model/ConstantOfShape_output_0"
    input: "/model/Constant_2_output_0"
    output: "/model/Where_output_0"
    name: "/model/Where"
    op_type: "Where"
  }
  node {
    input: "/model/Constant_1_output_0"
    input: "/model/Where_output_0"
    output: "/model/Expand_output_0"
    name: "/model/Expand"
    op_type: "Expand"
  }
  node {
    output: "/model/Constant_5_output_0"
    name: "/model/Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "attention_mask"
    input: "/model/Constant_5_output_0"
    output: "/model/Unsqueeze_output_0"
    name: "/model/Unsqueeze"
    op_type: "Unsqueeze"
  }
  node {
    output: "/model/Constant_6_output_0"
    name: "/model/Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/Unsqueeze_output_0"
    input: "/model/Constant_6_output_0"
    output: "/model/Unsqueeze_1_output_0"
    name: "/model/Unsqueeze_1"
    op_type: "Unsqueeze"
  }
  node {
    output: "/model/Constant_7_output_0"
    name: "/model/Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/Constant_8_output_0"
    name: "/model/Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/Constant_8_output_0"
    output: "/model/ConstantOfShape_1_output_0"
    name: "/model/ConstantOfShape_1"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/Constant_9_output_0"
    name: "/model/Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/ConstantOfShape_1_output_0"
    input: "/model/Constant_9_output_0"
    output: "/model/Mul_1_output_0"
    name: "/model/Mul_1"
    op_type: "Mul"
  }
  node {
    input: "/model/Constant_7_output_0"
    input: "/model/Mul_1_output_0"
    output: "/model/Equal_1_output_0"
    name: "/model/Equal_1"
    op_type: "Equal"
  }
  node {
    input: "/model/Equal_1_output_0"
    input: "/model/ConstantOfShape_1_output_0"
    input: "/model/Constant_7_output_0"
    output: "/model/Where_1_output_0"
    name: "/model/Where_1"
    op_type: "Where"
  }
  node {
    input: "/model/Unsqueeze_1_output_0"
    input: "/model/Where_1_output_0"
    output: "/model/Expand_1_output_0"
    name: "/model/Expand_1"
    op_type: "Expand"
  }
  node {
    input: "/model/Expand_1_output_0"
    output: "/model/Cast_output_0"
    name: "/model/Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "/model/Constant_10_output_0"
    name: "/model/Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/Constant_10_output_0"
    input: "/model/Cast_output_0"
    output: "/model/Sub_output_0"
    name: "/model/Sub"
    op_type: "Sub"
  }
  node {
    input: "/model/Sub_output_0"
    output: "/model/Cast_1_output_0"
    name: "/model/Cast_1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  node {
    input: "/model/Cast_1_output_0"
    output: "/model/Cast_2_output_0"
    name: "/model/Cast_2"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  node {
    output: "/model/Constant_11_output_0"
    name: "/model/Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\377\377\177\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/Cast_2_output_0"
    input: "/model/Constant_11_output_0"
    input: "/model/Sub_output_0"
    output: "/model/Where_2_output_0"
    name: "/model/Where_2"
    op_type: "Where"
  }
  node {
    input: "/model/Where_2_output_0"
    output: "/model/Cast_3_output_0"
    name: "/model/Cast_3"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model/Cast_3_output_0"
    output: "/model/Cast_4_output_0"
    name: "/model/Cast_4"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  node {
    input: "/model/Cast_4_output_0"
    output: "/model/Cast_5_output_0"
    name: "/model/Cast_5"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  node {
    output: "/model/Constant_12_output_0"
    name: "/model/Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\377\377\177\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/Cast_5_output_0"
    input: "/model/Constant_12_output_0"
    input: "/model/Expand_output_0"
    output: "/model/Where_3_output_0"
    name: "/model/Where_3"
    op_type: "Where"
  }
  node {
    input: "/model/embed_tokens/Gather_output_0"
    output: "/model/layers.0/input_layernorm/Cast_output_0"
    name: "/model/layers.0/input_layernorm/Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "/model/layers.0/input_layernorm/Constant_output_0"
    name: "/model/layers.0/input_layernorm/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/input_layernorm/Cast_output_0"
    input: "/model/layers.0/input_layernorm/Constant_output_0"
    output: "/model/layers.0/input_layernorm/Pow_output_0"
    name: "/model/layers.0/input_layernorm/Pow"
    op_type: "Pow"
  }
  node {
    input: "/model/layers.0/input_layernorm/Pow_output_0"
    output: "/model/layers.0/input_layernorm/ReduceMean_output_0"
    name: "/model/layers.0/input_layernorm/ReduceMean"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "/model/layers.0/input_layernorm/Constant_1_output_0"
    name: "/model/layers.0/input_layernorm/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/input_layernorm/ReduceMean_output_0"
    input: "/model/layers.0/input_layernorm/Constant_1_output_0"
    output: "/model/layers.0/input_layernorm/Add_output_0"
    name: "/model/layers.0/input_layernorm/Add"
    op_type: "Add"
  }
  node {
    input: "/model/layers.0/input_layernorm/Add_output_0"
    output: "/model/layers.0/input_layernorm/Sqrt_output_0"
    name: "/model/layers.0/input_layernorm/Sqrt"
    op_type: "Sqrt"
  }
  node {
    output: "/model/layers.0/input_layernorm/Constant_2_output_0"
    name: "/model/layers.0/input_layernorm/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/input_layernorm/Constant_2_output_0"
    input: "/model/layers.0/input_layernorm/Sqrt_output_0"
    output: "/model/layers.0/input_layernorm/Div_output_0"
    name: "/model/layers.0/input_layernorm/Div"
    op_type: "Div"
  }
  node {
    input: "/model/layers.0/input_layernorm/Cast_output_0"
    input: "/model/layers.0/input_layernorm/Div_output_0"
    output: "/model/layers.0/input_layernorm/Mul_output_0"
    name: "/model/layers.0/input_layernorm/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/input_layernorm/Mul_output_0"
    output: "/model/layers.0/input_layernorm/Cast_1_output_0"
    name: "/model/layers.0/input_layernorm/Cast_1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "model.layers.0.input_layernorm.weight"
    input: "/model/layers.0/input_layernorm/Cast_1_output_0"
    output: "/model/layers.0/input_layernorm/Mul_1_output_0"
    name: "/model/layers.0/input_layernorm/Mul_1"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/input_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1734"
    output: "/model/layers.0/self_attn/q_proj/MatMul_output_0"
    name: "/model/layers.0/self_attn/q_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.0/input_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1735"
    output: "/model/layers.0/self_attn/k_proj/MatMul_output_0"
    name: "/model/layers.0/self_attn/k_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.0/input_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1736"
    output: "/model/layers.0/self_attn/v_proj/MatMul_output_0"
    name: "/model/layers.0/self_attn/v_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    output: "/model/layers.0/self_attn/Constant_output_0"
    name: "/model/layers.0/self_attn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_1_output_0"
    name: "/model/layers.0/self_attn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_2_output_0"
    name: "/model/layers.0/self_attn/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/q_proj/MatMul_output_0"
    input: "/model/layers.0/self_attn/Constant_output_0"
    output: "/model/layers.0/self_attn/Reshape_output_0"
    name: "/model/layers.0/self_attn/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Reshape_output_0"
    output: "/model/layers.0/self_attn/Transpose_output_0"
    name: "/model/layers.0/self_attn/Transpose"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "/model/layers.0/self_attn/k_proj/MatMul_output_0"
    input: "/model/layers.0/self_attn/Constant_1_output_0"
    output: "/model/layers.0/self_attn/Reshape_1_output_0"
    name: "/model/layers.0/self_attn/Reshape_1"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Reshape_1_output_0"
    output: "/model/layers.0/self_attn/Transpose_1_output_0"
    name: "/model/layers.0/self_attn/Transpose_1"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "/model/layers.0/self_attn/v_proj/MatMul_output_0"
    input: "/model/layers.0/self_attn/Constant_2_output_0"
    output: "/model/layers.0/self_attn/Reshape_2_output_0"
    name: "/model/layers.0/self_attn/Reshape_2"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Reshape_2_output_0"
    output: "value_states"
    name: "/model/layers.0/self_attn/Transpose_2"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    output: "/model/layers.0/self_attn/rotary_emb/Constant_output_0"
    name: "/model/layers.0/self_attn/rotary_emb/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 8
        dims: 8
        data_type: 1
        raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?AQ\n?\230\270~?\271\374\177?\370\377\177?AQ\n?\230\270~?\271\374\177?\370\377\177?3\021\325\276\245\345z?\345\362\177?\337\377\177?3\021\325\276\245\345z?\345\362\177?\337\377\177?&p}\277\357\220t?\203\342\177?\265\377\177?&p}\277\357\220t?\203\342\177?\265\377\177?0U\'\277\247\312k?\224\313\177?z\377\177?0U\'\277\247\312k?\224\313\177?z\377\177?,<\221>@\251`?\031\256\177?.\377\177?,<\221>@\251`?\031\256\177?.\377\177?\270\315u?2IS?\022\212\177?\322\376\177?\270\315u?2IS?\022\212\177?\322\376\177?\275\377@?\263\314C?\201_\177?e\376\177?\275\377@?\263\314C?\201_\177?e\376\177?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/rotary_emb/Constant_1_output_0"
    name: "/model/layers.0/self_attn/rotary_emb/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 8
        dims: 8
        data_type: 1
        raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\244jW?wu\314=W\326#<n\022\203:\244jW?wu\314=W\326#<n\022\203:\267\307h?\371oK>>\324\243<i\022\003;\267\307h?\371oK>>\324\243<i\022\003;\303\201\020>mN\227>\037\271\365<\223\233D;\303\201\020>mN\227>\037\271\365<\223\233D;\317\275A\277\330a\307>\333\313#=X\022\203;\317\275A\277\330a\307>\333\313#=X\022\203;\020|u\277Dw\365>\364\266L=\336\326\243;\020|u\277Dw\365>\364\266L=\336\326\243;\214\017\217\276i\214\020?\321\234u=Y\233\304;\214\017\217\276i\214\020?\321\234u=Y\233\304;F0(?s\353$?2>\217=\307_\345;F0(?s\353$?2>\217=\307_\345;"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/rotary_emb/Constant_output_0"
    input: "/model/Constant_output_0"
    output: "/model/layers.0/self_attn/Gather_output_0"
    name: "/model/layers.0/self_attn/Gather"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_3_output_0"
    name: "/model/layers.0/self_attn/Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/Gather_output_0"
    input: "/model/layers.0/self_attn/Constant_3_output_0"
    output: "/model/layers.0/self_attn/Unsqueeze_output_0"
    name: "/model/layers.0/self_attn/Unsqueeze"
    op_type: "Unsqueeze"
  }
  node {
    input: "/model/layers.0/self_attn/rotary_emb/Constant_1_output_0"
    input: "/model/Constant_output_0"
    output: "/model/layers.0/self_attn/Gather_1_output_0"
    name: "/model/layers.0/self_attn/Gather_1"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_4_output_0"
    name: "/model/layers.0/self_attn/Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/Gather_1_output_0"
    input: "/model/layers.0/self_attn/Constant_4_output_0"
    output: "/model/layers.0/self_attn/Unsqueeze_1_output_0"
    name: "/model/layers.0/self_attn/Unsqueeze_1"
    op_type: "Unsqueeze"
  }
  node {
    input: "/model/layers.0/self_attn/Transpose_output_0"
    input: "/model/layers.0/self_attn/Unsqueeze_output_0"
    output: "/model/layers.0/self_attn/Mul_output_0"
    name: "/model/layers.0/self_attn/Mul"
    op_type: "Mul"
  }
  node {
    output: "/model/layers.0/self_attn/Constant_5_output_0"
    name: "/model/layers.0/self_attn/Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_6_output_0"
    name: "/model/layers.0/self_attn/Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_7_output_0"
    name: "/model/layers.0/self_attn/Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_8_output_0"
    name: "/model/layers.0/self_attn/Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/Transpose_output_0"
    input: "/model/layers.0/self_attn/Constant_6_output_0"
    input: "/model/layers.0/self_attn/Constant_7_output_0"
    input: "/model/layers.0/self_attn/Constant_5_output_0"
    input: "/model/layers.0/self_attn/Constant_8_output_0"
    output: "/model/layers.0/self_attn/Slice_output_0"
    name: "/model/layers.0/self_attn/Slice"
    op_type: "Slice"
  }
  node {
    output: "/model/layers.0/self_attn/Constant_9_output_0"
    name: "/model/layers.0/self_attn/Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_10_output_0"
    name: "/model/layers.0/self_attn/Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_11_output_0"
    name: "/model/layers.0/self_attn/Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_12_output_0"
    name: "/model/layers.0/self_attn/Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/Transpose_output_0"
    input: "/model/layers.0/self_attn/Constant_10_output_0"
    input: "/model/layers.0/self_attn/Constant_11_output_0"
    input: "/model/layers.0/self_attn/Constant_9_output_0"
    input: "/model/layers.0/self_attn/Constant_12_output_0"
    output: "/model/layers.0/self_attn/Slice_1_output_0"
    name: "/model/layers.0/self_attn/Slice_1"
    op_type: "Slice"
  }
  node {
    input: "/model/layers.0/self_attn/Slice_1_output_0"
    output: "/model/layers.0/self_attn/Neg_output_0"
    name: "/model/layers.0/self_attn/Neg"
    op_type: "Neg"
  }
  node {
    input: "/model/layers.0/self_attn/Neg_output_0"
    input: "/model/layers.0/self_attn/Slice_output_0"
    output: "/model/layers.0/self_attn/Concat_output_0"
    name: "/model/layers.0/self_attn/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Concat_output_0"
    input: "/model/layers.0/self_attn/Unsqueeze_1_output_0"
    output: "/model/layers.0/self_attn/Mul_1_output_0"
    name: "/model/layers.0/self_attn/Mul_1"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/self_attn/Mul_output_0"
    input: "/model/layers.0/self_attn/Mul_1_output_0"
    output: "/model/layers.0/self_attn/Add_output_0"
    name: "/model/layers.0/self_attn/Add"
    op_type: "Add"
  }
  node {
    input: "/model/layers.0/self_attn/Transpose_1_output_0"
    input: "/model/layers.0/self_attn/Unsqueeze_output_0"
    output: "/model/layers.0/self_attn/Mul_2_output_0"
    name: "/model/layers.0/self_attn/Mul_2"
    op_type: "Mul"
  }
  node {
    output: "/model/layers.0/self_attn/Constant_13_output_0"
    name: "/model/layers.0/self_attn/Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_14_output_0"
    name: "/model/layers.0/self_attn/Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_15_output_0"
    name: "/model/layers.0/self_attn/Constant_15"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_16_output_0"
    name: "/model/layers.0/self_attn/Constant_16"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/Transpose_1_output_0"
    input: "/model/layers.0/self_attn/Constant_14_output_0"
    input: "/model/layers.0/self_attn/Constant_15_output_0"
    input: "/model/layers.0/self_attn/Constant_13_output_0"
    input: "/model/layers.0/self_attn/Constant_16_output_0"
    output: "/model/layers.0/self_attn/Slice_2_output_0"
    name: "/model/layers.0/self_attn/Slice_2"
    op_type: "Slice"
  }
  node {
    output: "/model/layers.0/self_attn/Constant_17_output_0"
    name: "/model/layers.0/self_attn/Constant_17"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\003\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_18_output_0"
    name: "/model/layers.0/self_attn/Constant_18"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\004\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_19_output_0"
    name: "/model/layers.0/self_attn/Constant_19"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\177"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_20_output_0"
    name: "/model/layers.0/self_attn/Constant_20"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/Transpose_1_output_0"
    input: "/model/layers.0/self_attn/Constant_18_output_0"
    input: "/model/layers.0/self_attn/Constant_19_output_0"
    input: "/model/layers.0/self_attn/Constant_17_output_0"
    input: "/model/layers.0/self_attn/Constant_20_output_0"
    output: "/model/layers.0/self_attn/Slice_3_output_0"
    name: "/model/layers.0/self_attn/Slice_3"
    op_type: "Slice"
  }
  node {
    input: "/model/layers.0/self_attn/Slice_3_output_0"
    output: "/model/layers.0/self_attn/Neg_1_output_0"
    name: "/model/layers.0/self_attn/Neg_1"
    op_type: "Neg"
  }
  node {
    input: "/model/layers.0/self_attn/Neg_1_output_0"
    input: "/model/layers.0/self_attn/Slice_2_output_0"
    output: "/model/layers.0/self_attn/Concat_1_output_0"
    name: "/model/layers.0/self_attn/Concat_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Concat_1_output_0"
    input: "/model/layers.0/self_attn/Unsqueeze_1_output_0"
    output: "/model/layers.0/self_attn/Mul_3_output_0"
    name: "/model/layers.0/self_attn/Mul_3"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/self_attn/Mul_2_output_0"
    input: "/model/layers.0/self_attn/Mul_3_output_0"
    output: "key_states.3"
    name: "/model/layers.0/self_attn/Add_1"
    op_type: "Add"
  }
  node {
    input: "key_states.3"
    output: "/model/layers.0/self_attn/Transpose_3_output_0"
    name: "/model/layers.0/self_attn/Transpose_3"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 1
      ints: 3
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model/layers.0/self_attn/Add_output_0"
    input: "/model/layers.0/self_attn/Transpose_3_output_0"
    output: "/model/layers.0/self_attn/MatMul_output_0"
    name: "/model/layers.0/self_attn/MatMul"
    op_type: "MatMul"
  }
  node {
    output: "/model/layers.0/self_attn/Constant_21_output_0"
    name: "/model/layers.0/self_attn/Constant_21"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\363\0045@"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/MatMul_output_0"
    input: "/model/layers.0/self_attn/Constant_21_output_0"
    output: "/model/layers.0/self_attn/Div_output_0"
    name: "/model/layers.0/self_attn/Div"
    op_type: "Div"
  }
  node {
    input: "/model/layers.0/self_attn/Div_output_0"
    input: "/model/Where_3_output_0"
    output: "/model/layers.0/self_attn/Add_2_output_0"
    name: "/model/layers.0/self_attn/Add_2"
    op_type: "Add"
  }
  node {
    input: "/model/layers.0/self_attn/Add_2_output_0"
    output: "/model/layers.0/self_attn/Softmax_output_0"
    name: "/model/layers.0/self_attn/Softmax"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Softmax_output_0"
    output: "/model/layers.0/self_attn/Cast_output_0"
    name: "/model/layers.0/self_attn/Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Cast_output_0"
    output: "/model/layers.0/self_attn/Cast_1_output_0"
    name: "/model/layers.0/self_attn/Cast_1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Cast_1_output_0"
    input: "value_states"
    output: "/model/layers.0/self_attn/MatMul_1_output_0"
    name: "/model/layers.0/self_attn/MatMul_1"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.0/self_attn/MatMul_1_output_0"
    output: "/model/layers.0/self_attn/Transpose_4_output_0"
    name: "/model/layers.0/self_attn/Transpose_4"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    output: "/model/layers.0/self_attn/Constant_22_output_0"
    name: "/model/layers.0/self_attn/Constant_22"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\020\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/self_attn/Transpose_4_output_0"
    input: "/model/layers.0/self_attn/Constant_22_output_0"
    output: "/model/layers.0/self_attn/Reshape_3_output_0"
    name: "/model/layers.0/self_attn/Reshape_3"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model/layers.0/self_attn/Reshape_3_output_0"
    input: "onnx::MatMul_1772"
    output: "/model/layers.0/self_attn/o_proj/MatMul_output_0"
    name: "/model/layers.0/self_attn/o_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.0/input_layernorm/Cast_output_0"
    input: "/model/layers.0/self_attn/o_proj/MatMul_output_0"
    output: "/model/layers.0/Add_output_0"
    name: "/model/layers.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model/layers.0/Add_output_0"
    output: "/model/layers.0/post_attention_layernorm/Cast_output_0"
    name: "/model/layers.0/post_attention_layernorm/Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "/model/layers.0/post_attention_layernorm/Constant_output_0"
    name: "/model/layers.0/post_attention_layernorm/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Cast_output_0"
    input: "/model/layers.0/post_attention_layernorm/Constant_output_0"
    output: "/model/layers.0/post_attention_layernorm/Pow_output_0"
    name: "/model/layers.0/post_attention_layernorm/Pow"
    op_type: "Pow"
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Pow_output_0"
    output: "/model/layers.0/post_attention_layernorm/ReduceMean_output_0"
    name: "/model/layers.0/post_attention_layernorm/ReduceMean"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "/model/layers.0/post_attention_layernorm/Constant_1_output_0"
    name: "/model/layers.0/post_attention_layernorm/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/ReduceMean_output_0"
    input: "/model/layers.0/post_attention_layernorm/Constant_1_output_0"
    output: "/model/layers.0/post_attention_layernorm/Add_output_0"
    name: "/model/layers.0/post_attention_layernorm/Add"
    op_type: "Add"
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Add_output_0"
    output: "/model/layers.0/post_attention_layernorm/Sqrt_output_0"
    name: "/model/layers.0/post_attention_layernorm/Sqrt"
    op_type: "Sqrt"
  }
  node {
    output: "/model/layers.0/post_attention_layernorm/Constant_2_output_0"
    name: "/model/layers.0/post_attention_layernorm/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Constant_2_output_0"
    input: "/model/layers.0/post_attention_layernorm/Sqrt_output_0"
    output: "/model/layers.0/post_attention_layernorm/Div_output_0"
    name: "/model/layers.0/post_attention_layernorm/Div"
    op_type: "Div"
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Cast_output_0"
    input: "/model/layers.0/post_attention_layernorm/Div_output_0"
    output: "/model/layers.0/post_attention_layernorm/Mul_output_0"
    name: "/model/layers.0/post_attention_layernorm/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Mul_output_0"
    output: "/model/layers.0/post_attention_layernorm/Cast_1_output_0"
    name: "/model/layers.0/post_attention_layernorm/Cast_1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "model.layers.0.post_attention_layernorm.weight"
    input: "/model/layers.0/post_attention_layernorm/Cast_1_output_0"
    output: "/model/layers.0/post_attention_layernorm/Mul_1_output_0"
    name: "/model/layers.0/post_attention_layernorm/Mul_1"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1773"
    output: "/model/layers.0/mlp/gate_proj/MatMul_output_0"
    name: "/model/layers.0/mlp/gate_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.0/mlp/gate_proj/MatMul_output_0"
    output: "/model/layers.0/mlp/act_fn/Sigmoid_output_0"
    name: "/model/layers.0/mlp/act_fn/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model/layers.0/mlp/gate_proj/MatMul_output_0"
    input: "/model/layers.0/mlp/act_fn/Sigmoid_output_0"
    output: "/model/layers.0/mlp/act_fn/Mul_output_0"
    name: "/model/layers.0/mlp/act_fn/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1774"
    output: "/model/layers.0/mlp/up_proj/MatMul_output_0"
    name: "/model/layers.0/mlp/up_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.0/mlp/act_fn/Mul_output_0"
    input: "/model/layers.0/mlp/up_proj/MatMul_output_0"
    output: "/model/layers.0/mlp/Mul_output_0"
    name: "/model/layers.0/mlp/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.0/mlp/Mul_output_0"
    input: "onnx::MatMul_1775"
    output: "/model/layers.0/mlp/down_proj/MatMul_output_0"
    name: "/model/layers.0/mlp/down_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.0/post_attention_layernorm/Cast_output_0"
    input: "/model/layers.0/mlp/down_proj/MatMul_output_0"
    output: "/model/layers.0/Add_1_output_0"
    name: "/model/layers.0/Add_1"
    op_type: "Add"
  }
  node {
    input: "/model/layers.0/Add_1_output_0"
    output: "/model/layers.1/input_layernorm/Cast_output_0"
    name: "/model/layers.1/input_layernorm/Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    output: "/model/layers.1/input_layernorm/Constant_output_0"
    name: "/model/layers.1/input_layernorm/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000@"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.1/input_layernorm/Cast_output_0"
    input: "/model/layers.1/input_layernorm/Constant_output_0"
    output: "/model/layers.1/input_layernorm/Pow_output_0"
    name: "/model/layers.1/input_layernorm/Pow"
    op_type: "Pow"
  }
  node {
    input: "/model/layers.1/input_layernorm/Pow_output_0"
    output: "/model/layers.1/input_layernorm/ReduceMean_output_0"
    name: "/model/layers.1/input_layernorm/ReduceMean"
    op_type: "ReduceMean"
    attribute {
      name: "axes"
      ints: -1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 1
      type: INT
    }
  }
  node {
    output: "/model/layers.1/input_layernorm/Constant_1_output_0"
    name: "/model/layers.1/input_layernorm/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\2757\2065"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.1/input_layernorm/ReduceMean_output_0"
    input: "/model/layers.1/input_layernorm/Constant_1_output_0"
    output: "/model/layers.1/input_layernorm/Add_output_0"
    name: "/model/layers.1/input_layernorm/Add"
    op_type: "Add"
  }
  node {
    input: "/model/layers.1/input_layernorm/Add_output_0"
    output: "/model/layers.1/input_layernorm/Sqrt_output_0"
    name: "/model/layers.1/input_layernorm/Sqrt"
    op_type: "Sqrt"
  }
  node {
    output: "/model/layers.1/input_layernorm/Constant_2_output_0"
    name: "/model/layers.1/input_layernorm/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.1/input_layernorm/Constant_2_output_0"
    input: "/model/layers.1/input_layernorm/Sqrt_output_0"
    output: "/model/layers.1/input_layernorm/Div_output_0"
    name: "/model/layers.1/input_layernorm/Div"
    op_type: "Div"
  }
  node {
    input: "/model/layers.1/input_layernorm/Cast_output_0"
    input: "/model/layers.1/input_layernorm/Div_output_0"
    output: "/model/layers.1/input_layernorm/Mul_output_0"
    name: "/model/layers.1/input_layernorm/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.1/input_layernorm/Mul_output_0"
    output: "/model/layers.1/input_layernorm/Cast_1_output_0"
    name: "/model/layers.1/input_layernorm/Cast_1"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "model.layers.1.input_layernorm.weight"
    input: "/model/layers.1/input_layernorm/Cast_1_output_0"
    output: "/model/layers.1/input_layernorm/Mul_1_output_0"
    name: "/model/layers.1/input_layernorm/Mul_1"
    op_type: "Mul"
  }
  node {
    input: "/model/layers.1/input_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1776"
    output: "/model/layers.1/self_attn/q_proj/MatMul_output_0"
    name: "/model/layers.1/self_attn/q_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.1/input_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1777"
    output: "/model/layers.1/self_attn/k_proj/MatMul_output_0"
    name: "/model/layers.1/self_attn/k_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model/layers.1/input_layernorm/Mul_1_output_0"
    input: "onnx::MatMul_1778"
    output: "/model/layers.1/self_attn/v_proj/MatMul_output_0"
    name: "/model/layers.1/self_attn/v_proj/MatMul"
    op_type: "MatMul"
  }
  node {
    output: "/model/layers.1/self_attn/Constant_output_0"
    name: "/model/layers.1/self_attn/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.1/self_attn/Constant_1_output_0"
    name: "/model/layers.1/self_attn/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/model/layers.1/self_attn/Constant_2_output_0"
    name: "/model/layers.1/self_attn/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        raw_data: "\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000\002\000\000\000\000\000\000\000\010\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/model/layers.1/self_attn/q_proj/MatMul_output_0"
    input: "/model/layers.1/self_attn/Constant_output_0"
    output: "/model/layers.1/self_attn/Reshape_output_0"
    name: "/model/layers.1/self_attn/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model/layers.1/self_attn/Reshape_output_0"
    output: "/model/layers.1/self_attn/Transpose_output_0"
    name: "/model/layers.1/self_attn/Transpose"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "/model/layers.1/self_attn/k_proj/MatMul_output_0"
    input: "/model/layers.1/self_attn/Constant_1_output_0"
    output: "/model/layers.1/self_attn/Reshape_1_output_0"
    name: "/model/layers.1/self_attn/Reshape_1"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model/layers.1/self_attn/Reshape_1_output_0"
    output: "/model/layers.1/self_attn/Transpose_1_output_0"
    name: "/model/layers.1/self_attn/Transpose_1"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    input: "/model/layers.1/self_attn/v_proj/MatMul_output_0"
    input: "/model/layers.1/self_attn/Constant_2_output_0"
    output: "/model/layers.1/self_attn/Reshape_2_output_0"
    name: "/model/layers.1/self_attn/Reshape_2"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model/layers.1/self_attn/Reshape_2_output_0"
    output: "value_states.3"
    name: "/model/layers.1/self_attn/Transpose_2"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 2
      ints: 1
      ints: 3
      type: INTS
    }
  }
  node {
    output: "/model/layers.1/self_attn/rotary_emb/Constant_output_0"
    name: "/model/layers.1/self_attn/rotary_emb/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 8
        dims: 8
        data_type: 1
