ir_version: 8
producer_name: "pytorch"
producer_version: "2.2.0"
graph {
  node {
    input: "l_input_ids_"
    input: "model.decoder.embed_tokens.weight"
    input: "model.decoder.embed_positions.weights"
    input: "model.decoder.layers.0.self_attn.q_proj.weight"
    input: "model.decoder.layers.0.self_attn.q_proj.bias"
    input: "model.decoder.layers.0.self_attn.k_proj.weight"
    input: "model.decoder.layers.0.self_attn.k_proj.bias"
    input: "model.decoder.layers.0.self_attn.v_proj.weight"
    input: "model.decoder.layers.0.self_attn.v_proj.bias"
    input: "model.decoder.layers.0.self_attn.out_proj.weight"
    input: "model.decoder.layers.0.self_attn.out_proj.bias"
    input: "model.decoder.layers.0.self_attn_layer_norm.weight"
    input: "model.decoder.layers.0.self_attn_layer_norm.bias"
    input: "model.decoder.layers.0.fc1.weight"
    input: "model.decoder.layers.0.fc1.bias"
    input: "model.decoder.layers.0.fc2.weight"
    input: "model.decoder.layers.0.fc2.bias"
    input: "model.decoder.layers.0.final_layer_norm.weight"
    input: "model.decoder.layers.0.final_layer_norm.bias"
    input: "model.decoder.layers.1.self_attn.q_proj.weight"
    input: "model.decoder.layers.1.self_attn.q_proj.bias"
    input: "model.decoder.layers.1.self_attn.k_proj.weight"
    input: "model.decoder.layers.1.self_attn.k_proj.bias"
    input: "model.decoder.layers.1.self_attn.v_proj.weight"
    input: "model.decoder.layers.1.self_attn.v_proj.bias"
    input: "model.decoder.layers.1.self_attn.out_proj.weight"
    input: "model.decoder.layers.1.self_attn.out_proj.bias"
    input: "model.decoder.layers.1.self_attn_layer_norm.weight"
    input: "model.decoder.layers.1.self_attn_layer_norm.bias"
    input: "model.decoder.layers.1.fc1.weight"
    input: "model.decoder.layers.1.fc1.bias"
    input: "model.decoder.layers.1.fc2.weight"
    input: "model.decoder.layers.1.fc2.bias"
    input: "model.decoder.layers.1.final_layer_norm.weight"
    input: "model.decoder.layers.1.final_layer_norm.bias"
    input: "model.decoder.layers.2.self_attn.q_proj.weight"
    input: "model.decoder.layers.2.self_attn.q_proj.bias"
    input: "model.decoder.layers.2.self_attn.k_proj.weight"
    input: "model.decoder.layers.2.self_attn.k_proj.bias"
    input: "model.decoder.layers.2.self_attn.v_proj.weight"
    input: "model.decoder.layers.2.self_attn.v_proj.bias"
    input: "model.decoder.layers.2.self_attn.out_proj.weight"
    input: "model.decoder.layers.2.self_attn.out_proj.bias"
    input: "model.decoder.layers.2.self_attn_layer_norm.weight"
    input: "model.decoder.layers.2.self_attn_layer_norm.bias"
    input: "model.decoder.layers.2.fc1.weight"
    input: "model.decoder.layers.2.fc1.bias"
    input: "model.decoder.layers.2.fc2.weight"
    input: "model.decoder.layers.2.fc2.bias"
    input: "model.decoder.layers.2.final_layer_norm.weight"
    input: "model.decoder.layers.2.final_layer_norm.bias"
    input: "model.decoder.layers.3.self_attn.q_proj.weight"
    input: "model.decoder.layers.3.self_attn.q_proj.bias"
    input: "model.decoder.layers.3.self_attn.k_proj.weight"
    input: "model.decoder.layers.3.self_attn.k_proj.bias"
    input: "model.decoder.layers.3.self_attn.v_proj.weight"
    input: "model.decoder.layers.3.self_attn.v_proj.bias"
    input: "model.decoder.layers.3.self_attn.out_proj.weight"
    input: "model.decoder.layers.3.self_attn.out_proj.bias"
    input: "model.decoder.layers.3.self_attn_layer_norm.weight"
    input: "model.decoder.layers.3.self_attn_layer_norm.bias"
    input: "model.decoder.layers.3.fc1.weight"
    input: "model.decoder.layers.3.fc1.bias"
    input: "model.decoder.layers.3.fc2.weight"
    input: "model.decoder.layers.3.fc2.bias"
    input: "model.decoder.layers.3.final_layer_norm.weight"
    input: "model.decoder.layers.3.final_layer_norm.bias"
    input: "model.decoder.layers.4.self_attn.q_proj.weight"
    input: "model.decoder.layers.4.self_attn.q_proj.bias"
    input: "model.decoder.layers.4.self_attn.k_proj.weight"
    input: "model.decoder.layers.4.self_attn.k_proj.bias"
    input: "model.decoder.layers.4.self_attn.v_proj.weight"
    input: "model.decoder.layers.4.self_attn.v_proj.bias"
    input: "model.decoder.layers.4.self_attn.out_proj.weight"
    input: "model.decoder.layers.4.self_attn.out_proj.bias"
    input: "model.decoder.layers.4.self_attn_layer_norm.weight"
    input: "model.decoder.layers.4.self_attn_layer_norm.bias"
    input: "model.decoder.layers.4.fc1.weight"
    input: "model.decoder.layers.4.fc1.bias"
    input: "model.decoder.layers.4.fc2.weight"
    input: "model.decoder.layers.4.fc2.bias"
    input: "model.decoder.layers.4.final_layer_norm.weight"
    input: "model.decoder.layers.4.final_layer_norm.bias"
    input: "model.decoder.layers.5.self_attn.q_proj.weight"
    input: "model.decoder.layers.5.self_attn.q_proj.bias"
    input: "model.decoder.layers.5.self_attn.k_proj.weight"
    input: "model.decoder.layers.5.self_attn.k_proj.bias"
    input: "model.decoder.layers.5.self_attn.v_proj.weight"
    input: "model.decoder.layers.5.self_attn.v_proj.bias"
    input: "model.decoder.layers.5.self_attn.out_proj.weight"
    input: "model.decoder.layers.5.self_attn.out_proj.bias"
    input: "model.decoder.layers.5.self_attn_layer_norm.weight"
    input: "model.decoder.layers.5.self_attn_layer_norm.bias"
    input: "model.decoder.layers.5.fc1.weight"
    input: "model.decoder.layers.5.fc1.bias"
    input: "model.decoder.layers.5.fc2.weight"
    input: "model.decoder.layers.5.fc2.bias"
    input: "model.decoder.layers.5.final_layer_norm.weight"
    input: "model.decoder.layers.5.final_layer_norm.bias"
    output: "model_decoder_1"
    output: "model_decoder_1_1"
    output: "model_decoder_1_2"
    output: "model_decoder_1_3"
    output: "model_decoder_1_4"
    output: "model_decoder_1_5"
    output: "model_decoder_1_6"
    output: "model_decoder_1_7"
    output: "model_decoder_1_8"
    output: "model_decoder_1_9"
    output: "model_decoder_1_10"
    output: "model_decoder_1_11"
    output: "model_decoder_1_12"
    name: "transformers_models_speech_to_text_2_modeling_speech_to_text_2_Speech2Text2Decoder_model_decoder_1_7"
    op_type: "transformers_models_speech_to_text_2_modeling_speech_to_text_2_Speech2Text2Decoder_model_decoder_1"
    domain: "pkg.transformers.4.34.0.dev0"
  }
  node {
    input: "model_decoder_1_12"
    input: "model.decoder.embed_tokens.weight"
    output: "lm_head_1"
    name: "torch_nn_modules_linear_Linear_lm_head_1_8"
    op_type: "torch_nn_modules_linear_Linear_lm_head_1"
    domain: "pkg.torch.2.2.0a0+git63d65dd"
  }
  node {
    output: "_val_114"
    name: "Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\020\'\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "lm_head_1"
    input: "_val_114"
    output: "view_138"
    name: "aten_view_10"
    op_type: "aten_view"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    output: "_val_116"
    name: "Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "l_labels_"
    input: "_val_116"
    output: "view_139"
    name: "aten_view_12"
    op_type: "aten_view"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "view_138"
    output: "_log_softmax"
    name: "aten__log_softmax_13"
    op_type: "aten__log_softmax"
    attribute {
      name: "dim"
      i: 1
      type: INT
    }
    attribute {
      name: "half_to_float"
      i: 0
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    output: "_val_119"
    name: "Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\234\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "view_139"
    input: "_val_119"
    output: "ne_1"
    name: "aten_ne_15"
    op_type: "aten_ne"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    output: "_val_121"
    name: "Constant_16"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "_val_121"
    output: "scalar_tensor"
    name: "aten_scalar_tensor_sym_number_17"
    op_type: "aten_scalar_tensor_sym_number"
    attribute {
      name: "dtype"
      i: 7
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "ne_1"
    input: "view_139"
    input: "scalar_tensor"
    output: "where"
    name: "aten_where_18"
    op_type: "aten_where"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "where"
    output: "unsqueeze_4"
    name: "aten_unsqueeze_19"
    op_type: "aten_unsqueeze"
    attribute {
      name: "dim"
      i: 1
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "_log_softmax"
    input: "unsqueeze_4"
    output: "gather"
    name: "aten_gather_20"
    op_type: "aten_gather"
    attribute {
      name: "dim"
      i: 1
      type: INT
    }
    attribute {
      name: "sparse_grad"
      i: 0
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "gather"
    output: "squeeze"
    name: "aten_squeeze_dim_21"
    op_type: "aten_squeeze_dim"
    attribute {
      name: "dim"
      i: 1
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "squeeze"
    output: "neg"
    name: "aten_neg_22"
    op_type: "aten_neg"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    output: "_val_128"
    name: "Constant_23"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\234\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "view_139"
    input: "_val_128"
    output: "ne_2"
    name: "aten_ne_24"
    op_type: "aten_ne"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    output: "_val_130"
    name: "Constant_25"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "_val_130"
    output: "scalar_tensor_1"
    name: "aten_scalar_tensor_sym_number_26"
    op_type: "aten_scalar_tensor_sym_number"
    attribute {
      name: "dtype"
      i: 1
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "ne_2"
    input: "neg"
    input: "scalar_tensor_1"
    output: "where_1"
    name: "aten_where_27"
    op_type: "aten_where"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    output: "_val_133"
    name: "Constant_28"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\234\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "view_139"
    input: "_val_133"
    output: "ne_3"
    name: "aten_ne_29"
    op_type: "aten_ne"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "ne_3"
    output: "convert_element_type_default_1"
    name: "prims_convert_element_type_30"
    op_type: "prims_convert_element_type"
    attribute {
      name: "dtype"
      i: 7
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "convert_element_type_default_1"
    output: "sum_1"
    name: "_aten_sum_dim_none_31"
    op_type: "_aten_sum_dim_none"
    attribute {
      name: "keepdim"
      i: 0
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "sum_1"
    output: "convert_element_type_3"
    name: "prims_convert_element_type_32"
    op_type: "prims_convert_element_type"
    attribute {
      name: "dtype"
      i: 1
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "where_1"
    output: "sum_2"
    name: "_aten_sum_dim_none_33"
    op_type: "_aten_sum_dim_none"
    attribute {
      name: "keepdim"
      i: 0
      type: INT
    }
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "sum_2"
    input: "convert_element_type_3"
    output: "div"
    name: "aten_div_34"
    op_type: "aten_div"
    domain: "pkg.onnxscript.torch_lib"
  }
  name: "main_graph"
  initializer {
    dims: 10000
    dims: 256
    data_type: 1
    name: "model.decoder.embed_tokens.weight"
    raw_data: ""
  }
  initializer {
    dims: 1026
    dims: 256
    data_type: 1
    name: "model.decoder.embed_positions.weights"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.q_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.q_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.k_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.k_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.v_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.v_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.out_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn.out_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.self_attn_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 2048
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.fc1.weight"
    raw_data: ""
  }
  initializer {
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.0.fc1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.0.fc2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.fc2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.final_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.0.final_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.q_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.q_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.k_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.k_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.v_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.v_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.out_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn.out_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.self_attn_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 2048
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.fc1.weight"
    raw_data: ""
  }
  initializer {
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.1.fc1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.1.fc2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.fc2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.final_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.1.final_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.q_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.q_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.k_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.k_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.v_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.v_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.out_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn.out_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.self_attn_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 2048
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.fc1.weight"
    raw_data: ""
  }
  initializer {
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.2.fc1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.2.fc2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.fc2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.final_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.2.final_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.q_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.q_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.k_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.k_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.v_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.v_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.out_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn.out_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.self_attn_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 2048
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.fc1.weight"
    raw_data: ""
  }
  initializer {
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.3.fc1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.3.fc2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.fc2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.final_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.3.final_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.q_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.q_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.k_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.k_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.v_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.v_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.out_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn.out_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.self_attn_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 2048
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.fc1.weight"
    raw_data: ""
  }
  initializer {
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.4.fc1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.4.fc2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.fc2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.final_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.4.final_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.q_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.q_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.k_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.k_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.v_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.v_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.out_proj.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn.out_proj.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.self_attn_layer_norm.bias"
    raw_data: ""
  }
  initializer {
    dims: 2048
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.fc1.weight"
    raw_data: ""
  }
  initializer {
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.5.fc1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 2048
    data_type: 1
    name: "model.decoder.layers.5.fc2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.fc2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.final_layer_norm.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "model.decoder.layers.5.final_layer_norm.bias"
    raw_data: ""
  }
  input {
    name: "l_input_ids_"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "l_labels_"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  output {
    name: "div"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  output {
    name: "lm_head_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 10000
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_4"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_5"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_6"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_7"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_8"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_9"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_10"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  output {
    name: "model_decoder_1_11"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.embed_tokens.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10000
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.embed_positions.weights"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1026
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.q_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.q_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.k_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.k_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.v_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.v_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.out_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn.out_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.self_attn_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.fc1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.fc1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.fc2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.fc2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.final_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.0.final_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.q_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.q_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.k_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.k_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.v_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.v_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.out_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn.out_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.self_attn_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.fc1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.fc1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.fc2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.fc2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.final_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.1.final_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.q_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.q_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.k_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.k_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.v_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.v_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.out_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn.out_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.self_attn_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.fc1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.fc1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.fc2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.fc2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.final_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.2.final_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.q_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.q_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.k_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.k_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.v_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.v_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.out_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn.out_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.self_attn_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.fc1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.fc1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.fc2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.fc2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.final_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.3.final_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.q_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.q_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.k_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.k_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.v_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.v_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.out_proj.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn.out_proj.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.self_attn_layer_norm.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.fc1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.fc1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.fc2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 2048
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.fc2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.final_layer_norm.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "model.decoder.layers.4.final_layer_norm.bias"
