ir_version: 8
producer_name: "pytorch"
producer_version: "2.2.0"
graph {
  node {
    input: "l_x_"
    input: "conv1.weight"
    output: "conv1_1"
    name: "torch_nn_modules_conv_Conv2d_conv1_1_1"
    op_type: "torch_nn_modules_conv_Conv2d_conv1_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "conv1_1"
    input: "bn1.weight"
    input: "bn1.bias"
    input: "bn1.running_mean"
    input: "bn1.running_var"
    output: "bn1_1"
    name: "torch_nn_modules_batchnorm_BatchNorm2d_bn1_1_2"
    op_type: "torch_nn_modules_batchnorm_BatchNorm2d_bn1_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "bn1_1"
    output: "relu_1"
    name: "torch_nn_modules_activation_ReLU_relu_1_3"
    op_type: "torch_nn_modules_activation_ReLU_relu_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "relu_1"
    output: "maxpool_1"
    name: "torch_nn_modules_pooling_MaxPool2d_maxpool_1_4"
    op_type: "torch_nn_modules_pooling_MaxPool2d_maxpool_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "maxpool_1"
    input: "layer1.0.conv1.weight"
    input: "layer1.0.bn1.weight"
    input: "layer1.0.bn1.bias"
    input: "layer1.0.bn1.running_mean"
    input: "layer1.0.bn1.running_var"
    input: "layer1.0.conv2.weight"
    input: "layer1.0.bn2.weight"
    input: "layer1.0.bn2.bias"
    input: "layer1.0.bn2.running_mean"
    input: "layer1.0.bn2.running_var"
    input: "layer1.1.conv1.weight"
    input: "layer1.1.bn1.weight"
    input: "layer1.1.bn1.bias"
    input: "layer1.1.bn1.running_mean"
    input: "layer1.1.bn1.running_var"
    input: "layer1.1.conv2.weight"
    input: "layer1.1.bn2.weight"
    input: "layer1.1.bn2.bias"
    input: "layer1.1.bn2.running_mean"
    input: "layer1.1.bn2.running_var"
    output: "layer1_1"
    name: "torch_nn_modules_container_Sequential_layer1_1_5"
    op_type: "torch_nn_modules_container_Sequential_layer1_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "layer1_1"
    input: "layer2.0.conv1.weight"
    input: "layer2.0.bn1.weight"
    input: "layer2.0.bn1.bias"
    input: "layer2.0.bn1.running_mean"
    input: "layer2.0.bn1.running_var"
    input: "layer2.0.conv2.weight"
    input: "layer2.0.bn2.weight"
    input: "layer2.0.bn2.bias"
    input: "layer2.0.bn2.running_mean"
    input: "layer2.0.bn2.running_var"
    input: "layer2.0.downsample.0.weight"
    input: "layer2.0.downsample.1.weight"
    input: "layer2.0.downsample.1.bias"
    input: "layer2.0.downsample.1.running_mean"
    input: "layer2.0.downsample.1.running_var"
    input: "layer2.1.conv1.weight"
    input: "layer2.1.bn1.weight"
    input: "layer2.1.bn1.bias"
    input: "layer2.1.bn1.running_mean"
    input: "layer2.1.bn1.running_var"
    input: "layer2.1.conv2.weight"
    input: "layer2.1.bn2.weight"
    input: "layer2.1.bn2.bias"
    input: "layer2.1.bn2.running_mean"
    input: "layer2.1.bn2.running_var"
    output: "layer2_1"
    name: "torch_nn_modules_container_Sequential_layer2_1_6"
    op_type: "torch_nn_modules_container_Sequential_layer2_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "layer2_1"
    input: "layer3.0.conv1.weight"
    input: "layer3.0.bn1.weight"
    input: "layer3.0.bn1.bias"
    input: "layer3.0.bn1.running_mean"
    input: "layer3.0.bn1.running_var"
    input: "layer3.0.conv2.weight"
    input: "layer3.0.bn2.weight"
    input: "layer3.0.bn2.bias"
    input: "layer3.0.bn2.running_mean"
    input: "layer3.0.bn2.running_var"
    input: "layer3.0.downsample.0.weight"
    input: "layer3.0.downsample.1.weight"
    input: "layer3.0.downsample.1.bias"
    input: "layer3.0.downsample.1.running_mean"
    input: "layer3.0.downsample.1.running_var"
    input: "layer3.1.conv1.weight"
    input: "layer3.1.bn1.weight"
    input: "layer3.1.bn1.bias"
    input: "layer3.1.bn1.running_mean"
    input: "layer3.1.bn1.running_var"
    input: "layer3.1.conv2.weight"
    input: "layer3.1.bn2.weight"
    input: "layer3.1.bn2.bias"
    input: "layer3.1.bn2.running_mean"
    input: "layer3.1.bn2.running_var"
    output: "layer3_1"
    name: "torch_nn_modules_container_Sequential_layer3_1_7"
    op_type: "torch_nn_modules_container_Sequential_layer3_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "layer3_1"
    input: "layer4.0.conv1.weight"
    input: "layer4.0.bn1.weight"
    input: "layer4.0.bn1.bias"
    input: "layer4.0.bn1.running_mean"
    input: "layer4.0.bn1.running_var"
    input: "layer4.0.conv2.weight"
    input: "layer4.0.bn2.weight"
    input: "layer4.0.bn2.bias"
    input: "layer4.0.bn2.running_mean"
    input: "layer4.0.bn2.running_var"
    input: "layer4.0.downsample.0.weight"
    input: "layer4.0.downsample.1.weight"
    input: "layer4.0.downsample.1.bias"
    input: "layer4.0.downsample.1.running_mean"
    input: "layer4.0.downsample.1.running_var"
    input: "layer4.1.conv1.weight"
    input: "layer4.1.bn1.weight"
    input: "layer4.1.bn1.bias"
    input: "layer4.1.bn1.running_mean"
    input: "layer4.1.bn1.running_var"
    input: "layer4.1.conv2.weight"
    input: "layer4.1.bn2.weight"
    input: "layer4.1.bn2.bias"
    input: "layer4.1.bn2.running_mean"
    input: "layer4.1.bn2.running_var"
    output: "layer4_1"
    name: "torch_nn_modules_container_Sequential_layer4_1_8"
    op_type: "torch_nn_modules_container_Sequential_layer4_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    input: "layer4_1"
    output: "avgpool_1"
    name: "torch_nn_modules_pooling_AdaptiveAvgPool2d_avgpool_1_9"
    op_type: "torch_nn_modules_pooling_AdaptiveAvgPool2d_avgpool_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  node {
    output: "_val_110"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000\000\002\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "avgpool_1"
    input: "_val_110"
    output: "view"
    name: "aten_view_11"
    op_type: "aten_view"
    domain: "pkg.onnxscript.torch_lib"
  }
  node {
    input: "view"
    input: "fc.weight"
    input: "fc.bias"
    output: "fc_1"
    name: "torch_nn_modules_linear_Linear_fc_1_12"
    op_type: "torch_nn_modules_linear_Linear_fc_1"
    domain: "pkg.torch.2.2.0a0+git4ab5507"
  }
  name: "main_graph"
  initializer {
    dims: 64
    dims: 3
    dims: 7
    dims: 7
    data_type: 1
    name: "conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 64
    dims: 3
    dims: 3
    data_type: 1
    name: "layer1.0.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 64
    dims: 3
    dims: 3
    data_type: 1
    name: "layer1.0.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 64
    dims: 3
    dims: 3
    data_type: 1
    name: "layer1.1.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 64
    dims: 64
    dims: 3
    dims: 3
    data_type: 1
    name: "layer1.1.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 64
    data_type: 1
    name: "layer1.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 128
    dims: 64
    dims: 3
    dims: 3
    data_type: 1
    name: "layer2.0.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 128
    dims: 128
    dims: 3
    dims: 3
    data_type: 1
    name: "layer2.0.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 128
    dims: 64
    dims: 1
    dims: 1
    data_type: 1
    name: "layer2.0.downsample.0.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.downsample.1.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.downsample.1.bias"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.downsample.1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.0.downsample.1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 128
    dims: 128
    dims: 3
    dims: 3
    data_type: 1
    name: "layer2.1.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 128
    dims: 128
    dims: 3
    dims: 3
    data_type: 1
    name: "layer2.1.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 128
    data_type: 1
    name: "layer2.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 128
    dims: 3
    dims: 3
    data_type: 1
    name: "layer3.0.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    dims: 3
    dims: 3
    data_type: 1
    name: "layer3.0.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 128
    dims: 1
    dims: 1
    data_type: 1
    name: "layer3.0.downsample.0.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.downsample.1.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.downsample.1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.downsample.1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.0.downsample.1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    dims: 3
    dims: 3
    data_type: 1
    name: "layer3.1.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 256
    dims: 256
    dims: 3
    dims: 3
    data_type: 1
    name: "layer3.1.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 256
    data_type: 1
    name: "layer3.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 512
    dims: 256
    dims: 3
    dims: 3
    data_type: 1
    name: "layer4.0.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 512
    dims: 512
    dims: 3
    dims: 3
    data_type: 1
    name: "layer4.0.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 512
    dims: 256
    dims: 1
    dims: 1
    data_type: 1
    name: "layer4.0.downsample.0.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.downsample.1.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.downsample.1.bias"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.downsample.1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.0.downsample.1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 512
    dims: 512
    dims: 3
    dims: 3
    data_type: 1
    name: "layer4.1.conv1.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn1.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn1.bias"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn1.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn1.running_var"
    raw_data: ""
  }
  initializer {
    dims: 512
    dims: 512
    dims: 3
    dims: 3
    data_type: 1
    name: "layer4.1.conv2.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn2.weight"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn2.bias"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn2.running_mean"
    raw_data: ""
  }
  initializer {
    dims: 512
    data_type: 1
    name: "layer4.1.bn2.running_var"
    raw_data: ""
  }
  initializer {
    dims: 1000
    dims: 512
    data_type: 1
    name: "fc.weight"
    raw_data: ""
  }
  initializer {
    dims: 1000
    data_type: 1
    name: "fc.bias"
    raw_data: ""
  }
  input {
    name: "l_x_"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  output {
    name: "fc_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
  value_info {
    name: "conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.0.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer1.1.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.downsample.0.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.downsample.1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.downsample.1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.downsample.1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.0.downsample.1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer2.1.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.downsample.0.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.downsample.1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.downsample.1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.downsample.1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.0.downsample.1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer3.1.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.downsample.0.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.downsample.1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.downsample.1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.downsample.1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.0.downsample.1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.conv1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn1.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn1.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn1.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn1.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.conv2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn2.running_mean"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "layer4.1.bn2.running_var"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "fc.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1000
          }
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "fc.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1000
          }
        }
      }
    }
  }
  value_info {
    name: "conv1_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "bn1_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "relu_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "maxpool_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 56
          }
          dim {
            dim_value: 56
          }
        }
      }
    }
  }
  value_info {
    name: "layer1_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 56
          }
          dim {
            dim_value: 56
          }
        }
      }
    }
  }
  value_info {
    name: "layer2_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 28
          }
          dim {
            dim_value: 28
          }
        }
      }
    }
  }
  value_info {
    name: "layer3_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 14
          }
          dim {
            dim_value: 14
          }
        }
      }
    }
  }
  value_info {
    name: "layer4_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
  value_info {
    name: "avgpool_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  value_info {
    name: "_val_110"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  value_info {
    name: "view"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_conv_Conv2d_conv1_1/l_x_"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_conv_Conv2d_conv1_1/convolution"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_batchnorm_BatchNorm2d_bn1_1/convolution"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_batchnorm_BatchNorm2d_bn1_1/_native_batch_norm_legit_no_training"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_batchnorm_BatchNorm2d_bn1_1/_native_batch_norm_legit_no_training_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 0
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_batchnorm_BatchNorm2d_bn1_1/_native_batch_norm_legit_no_training_2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 0
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_activation_ReLU_relu_1/getitem"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_activation_ReLU_relu_1/relu"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_activation_ReLU_relu_1/copy"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_pooling_MaxPool2d_maxpool_1/copy"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_pooling_MaxPool2d_maxpool_1/max_pool2d_with_indices"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 56
          }
          dim {
            dim_value: 56
          }
        }
      }
    }
  }
  value_info {
    name: "pkg.torch.2.2.0a0+git4ab5507::torch_nn_modules_pooling_MaxPool2d_maxpool_1/max_pool2d_with_indices_1"
    type {
      tensor_type {
        elem_type: 7
